-- Вставка данных в таблицу Authors
INSERT INTO Authors (name, birth_date) VALUES
('Лев Толстой', '1828-09-09'),
('Фёдор Достоевский', '1821-11-11'),
('Антон Чехов', '1860-01-29'),
('Александр Пушкин', '1799-06-06'),
('Иван Тургенев', '1818-11-09'),
('Михаил Булгаков', '1891-05-15');

-- Вставка данных в таблицу Categories
INSERT INTO Categories (category_name) VALUES
('Роман'),
('Повесть'),
('Рассказы'),
('Поэзия'),
('Драма'),
('Фантастика');

-- Вставка данных в таблицу Books
INSERT INTO Books (title, fk_author_id, fk_category_id, published_date) VALUES
('Война и мир', 1, 1, '1869-01-01'),
('Преступление и наказание', 2, 1, '1866-01-01'),
('Человек в футляре', 3, 3, '1898-01-01'),
('Руслан и Людмила', 4, 4, '1820-01-01'),
('Отцы и дети', 5, 1, '1862-01-01'),
('Мастер и Маргарита', 6, 1, '1967-01-01');

-- Вставка данных в таблицу Members
INSERT INTO Members (full_name, membership_date) VALUES
('Иван Иванов', '2022-01-15'),
('Мария Петрова', '2022-02-20'),
('Сергей Сидоров', '2022-03-10'),
('Анна Смирнова', '2022-04-05'),
('Дмитрий Кузнецов', '2022-05-12'),
('Елена Васильева', '2022-06-18');

-- Вставка данных в таблицу Loans
INSERT INTO Loans (fk_book_id, fk_member_id, loan_date, return_date) VALUES
(1, 1, '2023-01-01', '2023-01-15'),
(2, 1, '2023-01-01', '2023-01-15'),
(3, 1, '2023-01-01', '2023-01-15'),
(4, 2, '2023-02-01', '2023-02-15'),
(5, 2, '2023-02-01', '2023-02-15'),
(6, 2, '2023-02-01', '2023-02-15'),
(3, 3, '2023-03-01', '2023-03-15'),
(4, 4, '2023-04-01', '2023-04-15'),
(5, 5, '2023-05-01', '2023-05-15'),
(6, 6, '2023-06-01', '2023-06-15');
