INSERT INTO Authors (name, birth_date) VALUES
('Лев Толстой', '1828-09-09'),
('Фёдор Достоевский', '1821-11-11'),
('Антон Чехов', '1860-01-29'),
('Александр Пушкин', '1799-06-06'),
('Иван Тургенев', '1818-11-09'),
('Михаил Булгаков', '1891-05-15');

INSERT INTO Categories (category_name) VALUES
('Роман'),
('Повесть'),
('Рассказы'),
('Поэзия'),
('Драма'),
('Фантастика');

INSERT INTO Books (title, fk_author_id, fk_category_id, published_date) VALUES
('Война и мир', 1, 1, '1869-01-01'),
('Преступление и наказание', 2, 1, '1866-01-01'),
('Человек в футляре', 3, 3, '1898-01-01'),
('Руслан и Людмила', 4, 4, '1820-01-01'),
('Отцы и дети', 5, 1, '1862-01-01'),
('Мастер и Маргарита', 6, 1, '1967-01-01');
